Revit 2027 API
NavisworksExportOptions.SetSelectedElementIds Method
 Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSelectedElementIds(
	ICollection<ElementId> ids
)
Public Sub SetSelectedElementIds (
	ids As ICollection(Of ElementId)
)
public:
void SetSelectedElementIds(
	ICollection<ElementId^>^ ids
)
member SetSelectedElementIds :
        ids : ICollection<ElementId> -> unit
Parameters
ids ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace